In [1]:
# Dependencies
import pandas as pd

In [2]:
# load CSV -- how do I do this without the full thread?
schools = ('/Users/RoFo/Dropbox/Data_Science_BC/GitHub/Git_Real_Repo/02-Homework/04-Numpy-Pandas/PyCitySchools/raw_data/schools_complete.csv')
students = ('/Users/RoFo/Dropbox/Data_Science_BC/GitHub/Git_Real_Repo/02-Homework/04-Numpy-Pandas/PyCitySchools/raw_data/students_complete.csv')

In [57]:
# Read schools with pandas
schools_pd = pd.read_csv(schools, encoding="iso-8859-1", low_memory=False)
students_pd = pd.read_csv(students, encoding="iso-8859-1", low_memory=False)
students_df.head()

,Student ID,Student Name,gender,grade,School Name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [58]:
# Or, I can get a reference to the column names this way
students_df.columns

Index(['Student ID', 'Student Name', 'gender', 'grade', 'School Name',
       'reading_score', 'math_score'],
      dtype='object')

In [7]:
# Rename columns | change "name" of students to "student name"
students_df = students_df.rename(columns={"name":"Student Name", "school":"School Name"})
students_df.columns

Index(['Student ID', 'Student Name', 'gender', 'grade', 'School Name',
       'reading_score', 'math_score'],
      dtype='object')

In [59]:
#change "name" of schools to "High School" 
schools_df = schools_df.rename(columns={"name":"School Name"})

In [60]:
# inner merge
school_master_df = pd.merge(schools_df, students_df, on = 'School Name')
school_master_df.head()

,School ID,School Name,type,size,budget,Student ID,Student Name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
3,0,Huang High School,District,2917,1910635,3,Dr. Richard Scott,M,12th,67,58
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84

In [152]:
# Calculate Total Students
Total_Students = school_master["Student Name"].count()
print(Total_Students)

39170

In [24]:
# value counts
Total_Schools = school_master["School Name"].value_counts()
print(Total_Schools)

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427
Name: School Name, dtype: int64

In [80]:
#unique
Total_Schools = school_master["School Name"].unique()
Total_Schools

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [81]:
len(Total_Schools)

15

In [82]:
#Calculate total budget -- this is wrong.  How do I eliminate the duplicates?
Total_Budget = schools_pd["budget"].sum()
Total_Budget = '${:,.0f}'.format(Total_Budget)
print(Total_Budget)

$24,649,428

In [125]:
# Average Math Score
Av_Math = round(school_master["math_score"].mean(), 2)
print(Av_Math)

78.99

In [126]:
#Average Reading Score
Av_Reading = round(school_master["reading_score"].mean(), 2)
print(Av_Reading)
Av_Reading =[Av_Reading]

81.88

In [85]:
# % Passing Math 
math_pass = school_master[school_master["math_score"] > 70]
math_pass = round(math_pass["math_score"].count()/Total_Students*100, 2)
math_pass

72.39

In [128]:
# % Passing Reading 
#this gives a list of those passing reading
reading_pass = school_master[school_master["reading_score"] > 70]
#this gives an integer ".count", which you can do math on
reading_pass = round(reading_pass["reading_score"].count()/Total_Students*100, 2)
reading_pass

82.97

In [168]:
# Overall Passing Rate (Average of the above two)
overall = (reading_pass+math_pass)/2

In [172]:
# Pretty table --> create a dictionary -> convert to DF "pd.DataFrame"

Schooled_df = pd.DataFrame({
    "Total Students": [Total_Students],
    "Total Schools": [len(Total_Schools)],
    "Total Budget": [Total_Budget],
    "% Passing Reading": [reading_pass],
    "% Passing Math": [math_pass],
    "Average Math Score": [Av_Math],
    "Average Reading Score": Av_Reading,
    "% Overall Passing": [overall]
})

In [173]:
#reset the index of the DF to get rid of the first column
Schooled_df.set_index("Total Schools", inplace=True)
Schooled_df

,% Overall Passing,% Passing Math,% Passing Reading,Average Math Score,Average Reading Score,Total Budget,Total Students
Total Schools,,,,,,,
15,77.68,72.39,82.97,78.99,81.88,"$24,649,428",39170

In [159]:
#build a table that indexes by school to do analysis